[{"pk": 1, "model": "mainsite.workachievement", "fields": {"entry": 1, "sort_order": 10.0, "description": "Consultant for various jobs. Created a data warehouse application in Django with advanced reshaping of data. "}}, {"pk": 2, "model": "mainsite.workachievement", "fields": {"entry": 2, "sort_order": 10.0, "description": "Heavy use of Django to create several internal tools, including an advanced scheduling tool used daily by the NOC team. This tool is capable of finding holes in the schedule, allowing users to request time off and allows managers to manage the schedule using a very slick UI. "}}, {"pk": 3, "model": "mainsite.workachievement", "fields": {"entry": 2, "sort_order": 10.0, "description": "In a very short time, learned the vast workings of one of the most complex Linux environments in existence. TiVo pioneered using Linux as an appliance, and the workplace offered the opportunity to work with some of the greatest minds in the field."}}, {"pk": 4, "model": "mainsite.workachievement", "fields": {"entry": 2, "sort_order": 10.0, "description": "Mixed heavy development talents with day-to-day operations within the NOC and was able to automate many tasks, saving several man-hours per day."}}, {"pk": 5, "model": "mainsite.workachievement", "fields": {"entry": 3, "sort_order": 10.0, "description": "Honored employee - awarded recognition In April 2009. The only person in a 200+ employee company to be honored the entire year of 2009."}}, {"pk": 6, "model": "mainsite.workachievement", "fields": {"entry": 3, "sort_order": 10.0, "description": "Assisted with migration from Sun Web Server to Apache. Wrote scripts to automatically migrate a huge list of redirects from Sun's XML redirect configuration to Apache's text based configuration."}}, {"pk": 7, "model": "mainsite.workachievement", "fields": {"entry": 3, "sort_order": 10.0, "description": "Heavy use of JQuery and Ajax to create a personal health record editor for users of MedicAlert service. This replaced an old broken system and the company was extremely pleased to go from several dozens of customer complaints per day to virtually zero."}}, {"pk": 8, "model": "mainsite.workachievement", "fields": {"entry": 3, "sort_order": 10.0, "description": "Developed a class library in .NET which acted as a transport for web service calls between a legacy VB6 app and newer web services."}}, {"pk": 9, "model": "mainsite.workachievement", "fields": {"entry": 4, "sort_order": 10.0, "description": "Developed an automatic update client run on the field by hundreds of ambulance which would query a web service to determine if a newer version of software was available. If a new package was available it would queue up the download using Microsoft's Background Intelligent Transfer Service (BITS) API , which would trickle download the file based on limited internet availability on the field. When the download was complete, the tool would decrypt the archive and extract, then automatically restart the necessary modules. Every bit of this was done without any UI interaction - completely invisible to the user."}}, {"pk": 10, "model": "mainsite.workachievement", "fields": {"entry": 4, "sort_order": 10.0, "description": "Created a very sophisticated console based daemon app which would monitor Tracy Fire Department's live data stream and send information to AMR's Ambulance dispatcher units through a six-step process of downloading, extracting, converting, processing, uploading, and logging. This data was emergency-service-critical and the daemon needed to be rock solid. It never once went down."}}, {"pk": 11, "model": "mainsite.workachievement", "fields": {"entry": 5, "sort_order": 10.0, "description": "Introduced and implemented object/relational persistence tools. Created entire class library, then used NHibernate to logically map all objects to existing database structure. Then created very simple CRUDs to allow edits through a .NET Web Service. "}}, {"pk": 12, "model": "mainsite.workachievement", "fields": {"entry": 6, "sort_order": 10.0, "description": "Migrated database from Oracle to SQL Server. "}}, {"pk": 13, "model": "mainsite.workachievement", "fields": {"entry": 6, "sort_order": 10.0, "description": "Developed entire cashiering system from the ground up using C# and SQL Server. This included an expansion of their database schema and migration of portions of an old, undocumented Cobol application."}}, {"pk": 14, "model": "mainsite.workachievement", "fields": {"entry": 6, "sort_order": 10.0, "description": "Created a ASP.NET web-based court calendar application to assist with the scheduling of court cases. This calendar has become a key component in their day-to-day operations and was featured in an article in the Modesto Bee."}}, {"pk": 15, "model": "mainsite.workachievement", "fields": {"entry": 7, "sort_order": 10.0, "description": "Developed a front-end Windows Forms user interface for data entry of lenders. Also created an auto-updating component that would query an internal web server on each launch, looking for updates. If updates were available, it would update the application and restart the application, all transparent to the user. "}}, {"pk": 16, "model": "mainsite.workachievement", "fields": {"entry": 7, "sort_order": 10.0, "description": "Performed load testing for migrating an existing application from JRUN to Tomcat with clustering and load balancing."}}, {"pk": 17, "model": "mainsite.workachievement", "fields": {"entry": 7, "sort_order": 10.0, "description": "Wrote an extensive logging framework for tracking and debugging issues within the enterprise applications."}}, {"pk": 18, "model": "mainsite.workachievement", "fields": {"entry": 8, "sort_order": 10.0, "description": "Used advanced geometry to create a geocoding algorithm which was capable of guessing the geographic location of a street address. "}}, {"pk": 19, "model": "mainsite.workachievement", "fields": {"entry": 8, "sort_order": 10.0, "description": "Created a real-time hierarchical database tracer for tracing pipe networks upstream or downstream."}}, {"pk": 20, "model": "mainsite.workachievement", "fields": {"entry": 8, "sort_order": 10.0, "description": "Developed a modular Web application framework backend in ColdFusion with a skinnable front-end."}}, {"pk": 21, "model": "mainsite.workachievement", "fields": {"entry": 8, "sort_order": 10.0, "description": "Designed, architected, and programmed many GIS solutions on a variety of platforms including ColdFusion, ASP.NET (C#), and J2EE (Tomcat)."}}, {"pk": 22, "model": "mainsite.workachievement", "fields": {"entry": 8, "sort_order": 10.0, "description": "Interfaced with many different database platforms including DB2, Oracle 8/9i, SQL Server, Microsoft Access, DBF, SHP, SDF, MySQL, and many more."}}, {"pk": 23, "model": "mainsite.workachievement", "fields": {"entry": 8, "sort_order": 10.0, "description": "Performed advanced file I/O on the SHP binary file format. This included parsing header information and creating a separate index file containing file offset addresses of key data."}}, {"pk": 24, "model": "mainsite.workachievement", "fields": {"entry": 8, "sort_order": 10.0, "description": "Created T-SQL and PL/SQL stored procedures for nightly batch processing of geographical data."}}, {"pk": 25, "model": "mainsite.workachievement", "fields": {"entry": 9, "sort_order": 10.0, "description": "Developed a secure authentication system for subscribers to an e-zine. (ASP 3.0) "}}, {"pk": 26, "model": "mainsite.workachievement", "fields": {"entry": 9, "sort_order": 10.0, "description": "Migrated a database of over 100,000 subscribers to a normalized database in SQL Server 2000."}}, {"pk": 27, "model": "mainsite.workachievement", "fields": {"entry": 10, "sort_order": 10.0, "description": "Managed a team of four developers in the creation of an intranet application for data entry. This included a rich front-end - heavy in JavaScript/DHTML, and a powerful back-end in ColdFusion.  "}}, {"pk": 28, "model": "mainsite.workachievement", "fields": {"entry": 10, "sort_order": 10.0, "description": "Developed a database logging system which would track the speed and accuracy of individual data entry clerks."}}, {"pk": 29, "model": "mainsite.workachievement", "fields": {"entry": 11, "sort_order": 10.0, "description": "Performed maintenance on a high-traffic web site to decrease load times. "}}, {"pk": 30, "model": "mainsite.workachievement", "fields": {"entry": 11, "sort_order": 10.0, "description": "Optimized back-end ColdFusion code to decrease server impact during peak traffic."}}, {"pk": 31, "model": "mainsite.workachievement", "fields": {"entry": 12, "sort_order": 10.0, "description": "Created dynamic front-end pages for large sites such as Pottery Barn, Williams-Sonoma, and Toys  Us. "}}, {"pk": 32, "model": "mainsite.workachievement", "fields": {"entry": 12, "sort_order": 10.0, "description": "Lead a team of six engineers for the entire front-end development of Williams-Sonoma Online Wedding Registry."}}, {"pk": 33, "model": "mainsite.workachievement", "fields": {"entry": 13, "sort_order": 10.0, "description": "Created an online telephone prefix lookup to find local numbers for a large ISP. "}}, {"pk": 34, "model": "mainsite.workachievement", "fields": {"entry": 13, "sort_order": 10.0, "description": "Used ColdFusion to create dynamic Web applications for several clients."}}, {"pk": 35, "model": "mainsite.workachievement", "fields": {"entry": 14, "sort_order": 10.0, "description": "Team leader in a team of seven - in an extremely fast-paced tools environment for one of the big names in video games. Used Python + Flask to develop internal tools to manage user data within several games. "}}, {"pk": 36, "model": "mainsite.workachievement", "fields": {"entry": 14, "sort_order": 10.0, "description": "Interacted with REST endpoints for several video games, creating a common UI to manage individual aspects of each game."}}, {"pk": 37, "model": "mainsite.workachievement", "fields": {"entry": 15, "sort_order": 10.0, "description": "Build infrastructure from the ground up using Python/Django deployed to Heroku. "}}, {"pk": 38, "model": "mainsite.workachievement", "fields": {"entry": 15, "sort_order": 10.0, "description": "Recruited and lead contractors and interns to assist in rapidly building a brand and operations infrastructure while seeking funding."}}]
